app/Controllers/Main.php

SELECT *
FROM `tasks`
WHERE `id_user` = '2'
---
    public function index()
    {
        // main page
        $data = [];

        // load tasks from the database and the user in session
        $tasks_model = new TasksModel();
        $data['tasks'] = $tasks_model->where('id_user', session()->id)->findAll();

SELECT *
FROM `usuarios`
WHERE `usuario` = 'user2'
 LIMIT 1
---
    public function login_submit()
    {
        // form validation
        $validation = $this->validate(
            // validation rules
            [
                'text_usuario' => 'required',
                'text_senha' => 'required',
            ],
            // validation errors
            [
                'text_usuario' => [
                    'required' => 'O campo usuário é obrigatório'
                ],
                'text_senha' => [
                    'required' => 'O campo senha é obrigatório'
                ]
            ]
        );

        if (!$validation) {
            return redirect()->to('login')->withInput()->with('validation_errors', $this->validator->getErrors());
        }

        // check if login is valid
        $usuario = $this->request->getPost('text_usuario');
        $senha = $this->request->getPost('text_senha');

        $usuarios_model = new UsuariosModel();
        $usuario_data = $usuarios_model->where('usuario', $usuario)->first();